ReadMe.org

* About
Willow eXtension Library (WX) は，組み込みマイコン用の拡張フレームワークです。

* WX for TWE-Lite MWX
** Module List
 - AQM0802: 8x2文字I2C接続LCD(ST7032i)搭載を使用するためのモジュール
 - ATP3011: AquesTalk pico 音声合成LSI(ATP3011)をSPIで利用するためのモジュール
 - FIFO: templateを使用した可変長リングバッファ

** See
以下に示すMWXの制限事項により，一部C++的に好ましくない実装があります．
 - new, new[] 演算子でのメモリ確保は行えますが、確保したメモリを破棄することはできません。C++ライブラリで動的メモリ確保をするものは殆どが事実上利用不可能です。一度だけ生成してそれ以降破棄しないオブジェクトに使用しています。
 - グローバルオブジェクトのコンストラクタが呼び出されません。
参考：必要な場合は、初期化関数(setup()) で new ((void*)&obj_global) class_foo(); のように初期化することでコンストラクタの呼び出しを含めた初期化を行えます。
 - 例外 exceptionが使用できません。
 - 仮想関数 virtualが使用できません。
